Repository: Soteyl/PasswordManager
Catalog: PasswordManager.TelegramClient/Resources/MessageBodies.*.resx
Languages: uk_ua

# WrongMessageWarningBody
source: ⚠️ **Please choose an option.**
uk_ua: ⚠️ **Будь ласка, виберіть опцію.**

# SetUpMasterPasswordMessageBody
source: 🔐 **Set up your master password:**
uk_ua: 🔐 **Встановіть ваш майстер-пароль:**

# YouNeedAtLeastOneCharForPassword
source: ⚠️ **Your master password must contain at least one character.**
uk_ua: ⚠️ **Ваш майстер-пароль має містити щонайменше один символ.**

# YourMasterPasswordIsApplied
source: ✅ **Your master password has been successfully applied!**
uk_ua: ✅ **Ваш майстер-пароль успішно встановлено!**

# YouHaveNoAccounts
source: 📭 **Your accounts list is empty.**
uk_ua: 📭 **Список ваших облікових записів порожній.**

# AccountsList
source: 📄 **Here are your accounts:** {0}
uk_ua: 📄 **Ось ваші облікові записи:** {0}

# InternalError
source: ❌ **Internal error. Please contact the developer.**
uk_ua: ❌ **Внутрішня помилка. Будь ласка, зверніться до розробника.**

# SendUrlToAddAccount
source: 🌐 **Please send the URL of your website:**
uk_ua: 🌐 **Будь ласка, надішліть URL вашого сайту:**

# SendWebsiteNicknameToAddAccount
source: 🏷 **Please provide a nickname for your website:**
uk_ua: 🏷 **Будь ласка, надайте псевдонім для вашого сайту:**

# SendUserToAddAccount
source: 👤 **Please send your username for this website:**
uk_ua: 👤 **Будь ласка, надішліть ваше ім'я користувача для цього сайту:**

# SendPasswordToAddAccount
source: 🔑 **Please send your password for this website:**
uk_ua: 🔑 **Будь ласка, надішліть ваш пароль для цього сайту:**

# AddAccountFinalStep
source: 💼 **Here is your account:** 🌐 **URL:** {0} 🏷 **Website:** {1} 👤 **Username:** {2} 🔑 **Password:** {3} 🔐 **Please provide a master password to encrypt your data:**
uk_ua: 💼 **Ось ваш обліковий запис:** 🌐 **URL:** {0} 🏷 **Сайт:** {1} 👤 **Ім'я користувача:** {2} 🔑 **Пароль:** {3} 🔐 **Будь ласка, надайте майстер-пароль для шифрування ваших даних:**

# WrongUrlFormat
source: ❌ **Invalid URL format. Please try again.**
uk_ua: ❌ **Неправильний формат URL. Будь ласка, спробуйте ще раз.**

# WrongMasterPassword
source: ⚠️ **Incorrect master password. Please try again or cancel the action.**
uk_ua: ⚠️ **Неправильний майстер-пароль. Будь ласка, спробуйте ще раз або скасуйте дію.**

# AddAccountSuccess
source: ✅ **Account successfully added!**
uk_ua: ✅ **Обліковий запис успішно додано!**

# SendMasterPasswordToEncrypt
source: 🔐 **Please provide your master password to encrypt data:**
uk_ua: 🔐 **Будь ласка, надайте ваш майстер-пароль для розшифрування даних:**

# GetCredentialsProvideMasterPassword
source: 📄 **URL:** {0} 🏷 **Website Name:** {1} 👤 **Username:** {2} 🔐 **To retrieve the credentials for this account, please provide the master password:**
uk_ua: 📄 **URL:** {0} 🏷 **Назва сайту:** {1} 👤 **Ім'я користувача:** {2} 🔐 **Для отримання облікових даних для цього запису, будь ласка, надайте майстер-пароль:**

# HereIsYourPassword
source: 🔑 **Here is your password. Copy it and use it as needed. It will be automatically deleted after 1 minute.**
uk_ua: 🔑 **Ось ваш пароль. Скопіюйте його і використовуйте за потреби. Він буде автоматично видалений через 1 хвилину.**

# ChooseAccountForCredentials
source: 📂 **Please choose the account you want to get credentials for.**
uk_ua: 📂 **Будь ласка, виберіть обліковий запис, для якого хочете отримати дані.**

# DeleteAccountConfirmation
source: 📄 **URL:** {0} 🏷 **Website Name:** {1} 👤 **Username:** {2} ⚠️ **Are you sure you want to delete this account? Please type the website name to confirm:**
uk_ua: 📄 **URL:** {0} 🏷 **Назва сайту:** {1} 👤 **Ім'я користувача:** {2} ⚠️ **Ви впевнені, що хочете видалити цей обліковий запис? Будь ласка, введіть назву сайту для підтвердження:**

# WrongDeleteAccountConfirmation
source: ❌ **Incorrect website name. Please try again or cancel:**
uk_ua: ❌ **Неправильна назва сайту. Будь ласка, спробуйте ще раз або скасуйте дію:**

# AccountDeleted
source: 🗑 **Account successfully deleted!**
uk_ua: 🗑 **Обліковий запис успішно видалено!**

# ChangeMasterPasswordConditions
source: 🔐 **To securely change your master password, please provide your old password and the new password on separate lines as follows:** oldPassword newPassword newPassword
uk_ua: 🔐 **Для безпечної зміни майстер-паролю, будь ласка, надайте ваш старий пароль і новий пароль на окремих рядках таким чином:** старийПароль новийПароль новийПароль

# WrongLinesCount
source: ❌ **Incorrect number of lines. Please try again.**
uk_ua: ❌ **Неправильна кількість рядків. Будь ласка, спробуйте ще раз.**

# NewMasterPasswordNotMatch
source: ❌ **The new passwords do not match. Please check and try again.**
uk_ua: ❌ **Нові паролі не збігаються. Будь ласка, перевірте і спробуйте ще раз.**

# MasterPasswordChanged
source: ✅ **Master password successfully changed!**
uk_ua: ✅ **Майстер-пароль успішно змінено!**

# ChooseSettingsToUpdate
source: ⚙️ **Please choose the settings you want to update:**
uk_ua: ⚙️ **Будь ласка, виберіть налаштування, які хочете оновити:**

# LanguageSelection
source: 🌐 **Please select your language:** - 🇬🇧 English - 🇺🇦 Українська
uk_ua: 🌐 **Будь ласка, виберіть вашу мову:** - 🇬🇧 English - 🇺🇦 Українська

# WrongLocaleChosen
source: ❌ **Invalid language selection. Please choose a valid option:** - 🇬🇧 English - 🇺🇦 Українська
uk_ua: ❌ **Неправильний вибір мови. Будь ласка, виберіть правильний варіант:** - 🇬🇧 English - 🇺🇦 Українська

# ChooseOnlyButtonValue
source: ⚠️ **You can only choose a button value.**
uk_ua: ⚠️ **Ви можете вибрати тільки значення кнопки.**
